app/graphql/mutations/auth_user.rb

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'tech@v-ecom.com' LIMIT 1
UPDATE `users` SET `users`.`tokens` = '{\"JeYx3Caw0yQVJ2FECAqxTA\":{\"token\":\"$2a$10$6RJQG8T5sIxZ5SWcZvyeY.rEU8n3tF6Agt79H6fxn/YWBPEYz/ktq\",\"expiry\":1581396530}}', `users`.`updated_at` = '2020-01-28 04:48:50.781037' WHERE `users`.`id` = 1
---
    def resolve(email: nil, password: nil)
      user = User.find_by(email: email, status: User.statuses[:active])

      if user.present? && user.valid_password?(password)
        # check if user already logged, return the old client token
        if context[:current_user].present? && user == context[:current_user]
          client = context[:auth_headers]['client']
          token = user.tokens[client].merge( client: client )

        else
          token = DeviseTokenAuth::TokenFactory.create
          user.tokens[token.client] = {
            token:  token.token_hash,
            expiry: token.expiry
          }
          user.save!