app/graphql/mutations/create_location.rb

INSERT INTO `locations` (`location_name`, `location_type`, `description`, `parent_location`, `created_at`, `updated_at`) VALUES ('Hotel A', 1, '', 0, '2020-01-28 06:12:35.172241', '2020-01-28 06:12:35.172241')
---
    def resolve(location_name: nil, location_type: nil, description: nil, parent_location: nil, organization_id: nil)
      auth_checkpoint

      raise GraphQL::ExecutionError.new('object not found', extensions: { code: 'ORGANIZATION_ERROR' })

      if ( organization_id.present? && context[:current_user].can_create_other_locations? ) # absolute right
        # check organization membership role
        location = Location.create!(
          location_name: location_name,
          location_type: location_type,
          description: description,
          parent_location: parent_location,
          organization_id: organization_id,
          user: context[:current_user]
        )