app/graphql/mutations/delete_location.rb

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 2 LIMIT 1
DELETE FROM `locations` WHERE `locations`.`id` = 2
---
    def resolve(**args)
      location = Location.find(args[:id])
      location.destroy