app/graphql/mutations/update_location.rb

    def resolve(id: nil, location_name: nil, location_type: nil, description: nil, parent_location: nil, organization_id: nil)

      raise GraphQL::ExecutionError, "LOCATION_ERROR" unless id.present? && Location.exists?(id)
      raise GraphQL::ExecutionError, "ORGANIZATION_ERROR" unless organization_id.present? && Organization.exists?(organization_id)

      if ( organization_id.present? && context[:current_user].can_update_other_locations? ) # absolute right
        # check organization membership role

        location = Location.find(id)
        location.update_attributes(
          location_name: :location_name,
          location_type: :location_type,
          parent_location: :parent_location,
          description: :description,
          organization_id: organization_id)
---
SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 2 LIMIT 1
UPDATE `locations` SET `locations`.`location_name` = 'Hotel B', `locations`.`description` = NULL, `locations`.`updated_at` = '2020-01-28 07:16:04.624416' WHERE `locations`.`id` = 2